# ╔══════════════════════════════════════════════════════════════════════════╗
# ║                           BREWFILE                                      ║
# ║  Установка:  brew bundle --file=packages/macos/Brewfile                 ║
# ║  Проверка:   brew bundle check --file=packages/macos/Brewfile           ║
# ╚══════════════════════════════════════════════════════════════════════════╝

# ── Терминалы ───────────────────────────────────────────────────────────────
cask "ghostty"               # основной терминал (нативный, Metal)
cask "alacritty"             # запасной терминал

# ── Шрифты ──────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"  # основной шрифт с иконками

# ── Shell ────────────────────────────────────────────────────────────────────
brew "zsh"                   # shell (проверь что стоит как default)
brew "stow"                  # управление симлинками dotfiles
brew "tmux"             	 # терминальный мультиплексор

# ── Редакторы ────────────────────────────────────────────────────────────────
cask "visual-studio-code"    # основной редактор
cask "zed"                   # быстрый редактор
brew "neovim"                # терминальный редактор (осваиваем постепенно)

# ── Git ──────────────────────────────────────────────────────────────────────
brew "git"                   # актуальная версия (не системный macOS git)
brew "git-delta"             # красивый diff с подсветкой синтаксиса

# ── Современные замены unix утилит ──────────────────────────────────────────
brew "eza"                   # замена ls: иконки, цвета, --tree режим
brew "bat"                   # замена cat: подсветка синтаксиса, git-diff
brew "fd"                    # замена find: быстрый, интуитивный синтаксис
brew "ripgrep"               # замена grep: очень быстрый поиск по коду
brew "fzf"                   # fuzzy finder: интерактивный поиск всего
brew "zoxide"                # замена cd: запоминает папки, прыгает по истории
brew "tldr"                  # короткие примеры вместо длинных man-страниц
brew "tree"                  # вывод структуры папок (классика)

# ── Файловый менеджер ────────────────────────────────────────────────────────
brew "yazi"                  # TUI файловый менеджер: 3 колонки, предпросмотр

# ── Dev: языки и версионирование ─────────────────────────────────────────────
brew "fnm"    				 # быстрый Node Version Manager (замена nvm, совместим с .nvmrc)
brew "uv"                    # Python менеджер (замена pip + pyenv + venv)
brew "go"                    # Golang

# ── Dev: утилиты ─────────────────────────────────────────────────────────────
cask "orbstack"              # замена Docker Desktop (быстрее, меньше RAM)
brew "lazydocker"            # TUI для управления Docker контейнерами
brew "lazygit"       		 # TUI клиент для git
cask "bruno"                 # замена Postman/Insomnia (коллекции хранятся в git)
cask "tableplus"             # GUI для баз данных
cask "dbeaver-community"     # универсальный GUI для баз данных
cask "redis-insight"         # GUI для Redis

# ── Браузеры ─────────────────────────────────────────────────────────────────
cask "brave-browser"         # основной браузер
cask "firefox"               # для тестирования / разработки
cask "yandex"                # Yandex Browser
# zen browser — только через официальный сайт (см. manual.md)

# ── Продуктивность ───────────────────────────────────────────────────────────
cask "obsidian"              # база знаний / заметки
cask "keepassxc"             # локальный менеджер паролей (.kdbx)

# ── Коммуникации ─────────────────────────────────────────────────────────────
cask "discord"
cask "zoom"

# ── Система ──────────────────────────────────────────────────────────────────
cask "linearmouse"           # настройка скролла для внешних мышей
cask "betterdisplay"         # HiDPI и настройка внешних мониторов
cask "appcleaner"            # полное удаление приложений с файлами
cask "utm"                   # виртуальные машины (замена VirtualBox для M1+)
