arjun.swagger-viewer
batisteo.vscode-django
beardedbear.beardedtheme
catppuccin.catppuccin-vsc
dbaeumer.vscode-eslint
donjayamanne.githistory
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dotjoshjohnson.xml
dracula-theme.theme-dracula
drblury.protobuf-vsc
eamodio.gitlens
enkia.tokyo-night
esbenp.prettier-vscode
firsttris.vscode-jest-runner
formulahendry.auto-close-tag
formulahendry.code-runner
golang.go
gruntfuggly.todo-tree
hediet.vscode-drawio
huizhou.githd
humao.rest-client
irongeek.vscode-env
kevinrose.vsc-python-indent
metaphore.kanagawa-vscode-color-theme
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
mtxr.sqltools
mtxr.sqltools-driver-sqlite
njpwerner.autodocstring
pkief.material-icon-theme
prisma.prisma
purpleschool.purpleschool-theme
redhat.vscode-yaml
ritwickdey.liveserver
sdras.night-owl
simonsiefke.svg-preview
stylelint.vscode-stylelint
teabyii.ayu
usernamehw.errorlens
wholroyd.jinja
zhuangtongfa.material-theme
